#                        Рівень 1. Логічний тип даних та логічні вирази
#   Завдання 1. Визначення результатів виразів
# print(10 > 5)             -- True
# print(10 == 5)            -- False
# print(7 != 3)             -- True
# print(12 <= 12)           -- True
# print(15 < 10)            -- False

# print(True and False)     -- False
# print(True or False)      -- True
# print(not True)           -- False
# print(not False)          -- True

# print(5 > 3 and 10 < 20)  -- True
# print(5 > 3 and 10 > 20)  -- False
# print(5 < 3 or 10 < 20)   -- True
# print(not (5 > 3))        -- False
# print(5 > 3 or 10 / 0 > 1)-- True

# print(0 or 15)
# print(10 and 20)
# print("" or "Python")
# print([] and [1, 2, 3])

# 1. Останні чотири вирази не мають ніякої умови для логічних операторів OR та AND

# 2. Оскільки в даному виразі використовується оператор OR, який спочатку перевіряє чи є перший вираз True і тільки якщо
#       він дасть False, то він перейде до перевірки другого виразу, а в нашому випадку перший вираз (5 > 3) одразу дає True,
#       тому Python закінчив перевірку та видав результат True

# 3. Для оператора AND. Якщо перша частина виразу вже False, Python не має сенсу обчислювати другу частину.
#    Для оператора OR. Якщо перша частина вже True, Python може не обчислювати другу частину.

# -------------------------------------------------------------------------------------------

#                           Рівень 2. Побудова логічних умов
#   Завдання 4. Система доступу

age = 21
is_authenticated = True
is_blocked = False
has_permission = True

access = "Доступ дозволено" if age >= 18 and is_authenticated and has_permission and not is_blocked else "Доступ заборонено"
print(access)

# "Доступ дозволено" оскільки всі чотири параметри відповідають вимогам
# ----------------------------------------------------
age = 17
is_authenticated = True
is_blocked = False
has_permission = True

access = "Доступ дозволено" if age >= 18 and is_authenticated and has_permission and not is_blocked else "Доступ заборонено"
print(access)

# "Доступ заборонено" оскільки вік користувача менше 18 років
# ---------------------------------------------------
age = 21
is_authenticated = False
is_blocked = False
has_permission = True

access = "Доступ дозволено" if age >= 18 and is_authenticated and has_permission and not is_blocked else "Доступ заборонено"
print(access)

# "Доступ заборонено" оскільки не виконується умова по авторизації
# ----------------------------------------------------
age = 21
is_authenticated = True
is_blocked = True
has_permission = True

access = "Доступ дозволено" if age >= 18 and is_authenticated and has_permission and not is_blocked else "Доступ заборонено"
print(access)

# "Доступ заборонено" оскільки користувач заблокований
# -----------------------------------------------------
age = 21
is_authenticated = True
is_blocked = False
has_permission = False

access = "Доступ дозволено" if age >= 18 and is_authenticated and has_permission and not is_blocked else "Доступ заборонено"
print(access)

# "Доступ заборонено" оскільки не виконується умова мати необхідний дозвіл

# -------------------------------------------------------------------------------------------------------------

#   Завдання 5. Валідація даних користувача

username = "student_01"
email = "student@example.com"
age = 20
password = "Python123"

if len(username) < 5:
    print("Ім'я користувача має бути щонайменше п'ять символів")
if username == "":
    print("Ім'я користувача не має бути порожнім")
if len(password) < 8:
    print("Пароль має містити не менше восьми символів")
if "@" not in email:
    print("Невірна електронна пошта")
if age < 16:
    print("Для доступу повинно бути більше 16 років")

is_valid = "Реєстрація успішна" if len(username) >= 5 and len(password) >= 8 and "@" in email and age >= 16 else "Реєстрація не пройдена"
print(is_valid)
# ----------------------------------------------------------------------------------------------
#                              Рівень 3. Побітові операції

#       Завдання 6. Робота з двійковими числами

    # Число А         Число В         Операція        Результат в двійковій         Результат в десятковій
    # 5               3               A & B           101 & 011 = 001               1
    # 5               3               A | B           101 | 011 = 011               7
    # 5               3               A ^ B           101 ^ 011 = 110               6
    # 12              10              A & B           1100 & 1010 = 1000            8
    # 12              10              A | B           1100 | 1010 = 1110            14
    # 12              10              A ^ B           1100 ^ 1010 = 0110            6
    # 8               -               ~A             ~1000                          -9
    # 5               -               A << 2          101 -> 10100                  20
    # 20              -               A >> 2          10100 -> 00101                5

print("5 & 3 =", 5 & 3, bin(5 & 3))
print("5 | 3 =", 5 | 3, bin(5 | 3))
print("5 ^ 3 =", 5 ^ 3, bin(5 ^ 3))

print("12 & 10 =", 12 & 10, bin(12 & 10))
print("12 | 10 =", 12 | 10, bin(12 | 10))
print("12 ^ 10 =", 12 ^ 10, bin(12 ^ 10))

print("~8 =", ~8, bin(~8))
print("5 << 2 =", 5 << 2, bin(5 << 2))
print("20 >> 2 =", 20 >> 2, bin(20 >> 2))

# В Python результат для чисел з побітовим НЕ (~) можливо розрахувати за формуло:
# ~A = -(A + 1)
# Саме тому:
# ~5 = -(5 + 1) = -6
# -----------------------------------------------------------------------------------------

#                               Рівень 4. Умовні конструкції

#       Завдання 10. Множинний вибір — система оцінювання

points = int(input("Введіть кількість балів: "))

if 0 <= points <= 100:
    if points <= 59:
        print("Оцінка F")
    elif points <= 69:
        print("Оцінка D")
    elif points <= 79:
        print("Оцінка C")
    elif points <= 89:
        print("Оцінка B")
    elif points <= 100:
        print("Оцінка A")
else:
    print("Бали повинні бути в діапазоні від 0 до 100")

# Порядок важливий тому що спочатку ми перевірили, що бали входять в діапазон від 0 до 100, і тільки
# після цього якщо умова виконалась ми переходимо до пошуку в якому діапазоні знаходяться наші бали.
# Оскільки Python виконує програму послідовно по рядках, то ми перевіряємо від молодшого діапазону оцінювання до старшого,
# коли програма знайде потрібний діапазон - програма зупиниться та напише нам результат.
# --------------------------------------------------------------------------------------------

#                       Рівень 5. Комплексні алгоритми

#       Завдання 15. Банкомат

balance = 2000
amount = 3000
is_card_active = True
is_blocked = False

if not is_card_active or is_blocked:
    print("Карта не активна!")
elif 0 >= amount or amount > 5000:
    print("Сума зняття повинна бути від 1 до 5000")
elif amount > balance:
    print("Недостатньо коштів на рахунку")
    print("Баланс:", balance)

else:
    print("Операція успішна!")
    print("Залишок на рахунку:", balance - amount)
# -------------------------------------------------

#       Завдання 16. Світлофор

color = "blue"

if color == "yellow":
    print("Очікувати або підготуватися відповідно до навчальної моделі")
elif color == "green":
    print("Рух дозволено за умови безпеки")
elif color == "red":
    print("Зупинитися")
else:
    print("Невідомий сигнал")

match color:
    case "yellow":
        print("Очікувати або підготуватися відповідно до навчальної моделі")
    case "green":
        print("Рух дозволено за умови безпеки")
    case "red":
        print("Зупинитися")
    case _:
        print("Невідомий сигнал")

# Варіант з if/elif/else є універсальним та підходить для перевірки різних умов, зокрема складних логічних виразів.
# Варіант match/case зручний, коли потрібно порівняти одну змінну з кількома конкретними значеннями, він має зрозумілу
# структуру, тому його легше читати.
# Я думаю, що в цьому завданні match/case є трохи зручнішим та читабельнішим























