#         Частина 1. Теоретичний блок (аналіз та порівняння)
#
# 1. Компілятор переводить програму цілком в код перед виконанням,
#     а інтерпретатор виконує програму під час запуску
#     Python є інтерпретованою мовою програмування, тому що він
#     виконується у інтерпретаторі
#
# 2. В статичній типізації тип змінної визначається при написанні коду
#     та він контролюється мовою програмування до виконання програми
#     Наприклад С++
#     А у динамічній типізації ми не вказуємо тип при написанні коду,
#     мова програмування сама вирішує в залежності від об'єкта
#     Наприклад Python
#
# 3. Python є мовою з сильною типізацією, оскільки він не виконує
#     автоматичне перетворення несумісних типів даних
#     При спробі виконати "10" + 5 виникне помилка TypeError,
#     тому що "10" - це рядок (str), а 5 - ціле число (int)
#     Python не може додати рядок до числа
#
# ------------------------------------------------------------------------
#
#        Частина 2. Алгоритмічне мислення (псевдокод)
#
# CONSTANT_DELIVERY_COST = x
#
# Запросити у споживача ціну
# Запросити кількість
#
# Вартість = ціна * кількість
# Загальна вартість = Вартість + CONSTANT_DELIVERY_COST
#
# Вивести фінальний чек загальної вартості (print)
#
# --------------------------------------------------------------------------
#
#        Частина 3. Практичні завдання на Python
#
# Завдання 3.1. Калькулятор розрахунку подорожі (змінні, константи, арифметика)
#
FUEL_PRICE = 55.5
CONSUMPTION_PER_100KM = 8.2
distance = float(input("Введіть відстань поїздки: "))

fuel_consumption = distance /100 * CONSUMPTION_PER_100KM
price_trip = fuel_consumption * FUEL_PRICE
multiple_ten = distance // 10
remainder = distance % 10

print(f"Витрачене пальне: {round(fuel_consumption, 2)} л, Вартість поїздки: {round(price_trip, 2)} грн., Повні десятки км: {multiple_ten} км, Залишається 'згоріти': {remainder} км")
# _____________________________________________________________________________
#
# Завдання 3.2. Перевірка доступу (логічні операції)
#
age = int(input("Введіть вік: "))
is_student = input("Ви студент?(yes/no): ") == "yes"
discount_allowed = not (age > 18 and age < 60) or (is_student and age < 25)
if discount_allowed:
    print("Вам доступна знижка")
else:
    print("Знижка не доступна")
# _____________________________________________________________________________
#
# Завдання 3.3. Обробка профілю користувача (методи рядків)

name = input("Введіть повне ім'я: ")
name = name.strip().title()
surname = name.split()[1]
surname_id = name.find(surname)

print(f"Вітаємо у системі, {name}! Ваш профіль успішно активовано.")





