#                   Частина 1. Перевірка теоретичних знань

# 1. Циклічний алгоритм - це алгоритм, в якому послідовність дій повторюється декілька разів,
#    поки виконується задана умова, чи до поки не виконається потрібна кількість повторів
#   Приклади:
#       1. При авторизації користувача, якщо логін чи пароль невірний програма запитує заново
#       2. Обробка замовлень в інтернет-магазині, наприклад взяти товар з замовлення та перевірити його сплату
#           та наявність, потім перейти до наступного товару в замовлені і т.д допоки черга не скінчиться
#       3. Перевірка листів на єл. пошті на важливість. Програма повинна взяти лист та перевірити тему та відправника,
#           якщо важливий лист помітити, потім перейти до наступного и так до останнього листа
# -----------------------------------------------------
# 2. Основні властивості алгоритму: дискретність, визначеність, результативність, завершуваність, масовість,
#   зрозумілість, універсальність та ефективність
#     Скінченність важлива, тому що цикл повинен мати умову завершення, інакше він може виконуватися нескінченно
#     Визначеність важлива, тому що умова продовження або завершення циклу повинна бути чіткою, щоб програма
#     працювала передбачувано
# -----------------------------------------------------
# 3. Цикл while виконується до поки умова залишається істинною, та кількість повторень заздалегідь може бути невідомою
#    Цикл for використовується переважно для перебору елементів, або для повторення дій задану кількість разів
# -----------------------------------------------------
# 4. Функція range() повертає всі цілі числа в заданому діапазоні (не враховуючи останнє значення) та з заданим кроком
#    range(5) поверне (0, 1, 2, 3, 4)
#    range(2, 8) поверне (2, 3, 4, 5, 6, 7)
#    range(2, 10, 2) поверне (2, 4, 6, 8)
#    range(10, 2, -2) поверне (10, 8, 6, 4)
# ------------------------------------------------------
# 5. Крок range() не може дорівнювати нулю, Python видасть помилку
# ------------------------------------------------------
# 6. Нескінченний цикл - це цикл, який не завершується, оскільки умова для його зупинки ніколи не виконається
#    Наприклад, якщо в циклі while забути зменшувати або збільшувати змінну, від якої залежить умова
#
#   number = 1
#   while number < 10:
#       print(number)
#
#    number завжди дорівнює 1, тому умова постійно залишається істинною, цикл николи не завершиться
# --------------------------------------------------------
# 7. Оператор break перериває цикл та виходить з нього
#    Оператор continue не завершує цикл, а пропускає поточну ітерацію циклу та переходить до наступної
# -------------------------------------------------------
# 8. У циклах for та while else виконується, тільки в випадку коли цикл завершився без break,
#    а else після if виконується, коли умова if не виконалась
# ------------------------------------------------------
# 9. У циклах else виконується, тільки в випадку коли цикл завершився без break. Якщо цикл перерветься через break,
#    то блок else не виконається
# ------------------------------------------------------
# 10. Якщо цикл завершується природним шляхом, але його тіло не виконується жодного разу, то виконається блок else
#     за наявності, якщо блока else немає - програма просто перейде до виконання наступних команд після циклу
#     1. Вкладений цикл - це цикл всередині іншого циклу. Для кожної ітерації зовнішнього циклу внутрішній цикл
#       виконується повністю. Загальна кількість виконань залежить від кількості ітерацій обох циклів.
#     2. Якщо лічильник не змінюється правильно, умова циклу може завжди залишатися істинною, у результаті цикл
#       не завершиться і буде виконуватися нескінченно.
# ------------------------------------------------------

#                   Частина 2. Передбачте результат виконання коду
# Завдання 2.1. Робота з range()

for i in range(2, 12, 3):
    print(i, end=" ")

# Буде виведено числа 2, 5, 8, 11, тому що range(2, 12, 3) починає з числа 2 і збільшує його на 3 на кожній ітерації,
# останнє число 12 не включається, тому останнім буде 11.
# ---------------------------------------------------------
# Завдання 2.2. Зміна лічильника

number = 1

while number <= 5:
    print(number, end=" ")
    number += 2

# Тіло циклу виконається три рази та number прийме значення: 1, 3, 5
# -------------------------------------------------------
# Завдання 2.3. Оператор continue

for number in range(1, 8):
    if number % 2 == 0:
        continue
    print(number, end=" ")

# Виведуться числа: 1, 3, 5, 7. Парні числа не потрапили в результат, тому що ми вказали умову:
# якщо number ділиться на два без остачі -> continue (пропускаємо та переходимо до наступного числа)
# -------------------------------------------------------
# Завдання 2.4. Оператор break

for number in range(1, 8):
    if number > 4:
        break
    print(number, end=" ")

# Цикл припинить роботу на значенні 4, тому що наступне буде 5, а за умовою якщо
# nuber суворо більше 4, то перериваємо цикл по break.
# Так, значення 4 буде виведено, тому що воно не є більше за 4 (рівне)
# ------------------------------------------------------
# Завдання 2.5. Циклічний else

for number in range(1, 6):
    if number == 3:
        break
else:
    print("Завершено")
    print("Кінець програми")

# Нічого не буде виведено, тому що наш цикл дійшов до числа 3, а за умовою, якщо number дорівнює 3,
# то ми виходимо з циклу по break, а при перериванні циклу по break блок else не виконується
# Що б повідомлення "Завершено" з'явилось, ми повинні перенести print("Завершено") у блок if перед break

for number in range(1, 6):
    if number == 3:
        print("Завершено")
        break
else:
    print("Кінець програми")
# ------------------------------------------------------
# Завдання 2.6. Порожня послідовність

for item in []:
    print("Тіло циклу")
else:
    print("Цикл завершено")

# Блок else виконується, тому що цикл завершився природним шляхом без використання break.
# В даному випадку цикл все одно завершився, просто не виконуючись жодного разу
# ------------------------------------------------------
# Завдання 2.7. Вкладені цикли

for i in range(1, 4):
    for j in range(1, 3):
        print(i, j)

# Буде виведено 6 рядків. Зовнішній цикл виконується 3 рази, а внутрішній - 2 рази для
# кожної ітерації зовнішнього циклу. Загальна кількість виконань внутрішнього циклу буде складати 6 разів
# ------------------------------------------------------
# Завдання 2.8. Комбінування операторів

for i in range(1, 6):
    if i == 2:
        continue
    if i == 5:
        break
    print(i, end=" ")
else:
    print("Готово")

# Результат буде: 1, 3, 4.
# continue пропускає поточну ітерацію та переходить до наступної, а break повністю перериває цикл.
# Тому число 2 не виводиться, а при і == 5 цикл завершується, і число 5 не виводиться.
# Також не спрацює блок else, тому що цикл перервався по break
